MikroElektronika/core_packages/PIC/XC8/def/PIC18F46J13/mcu.h
extern volatile PMCONHbits_t PMCONHbits __at(0xF5F);
// bitfield macros
#define _PMCONH_PTRDEN_POSN                                 0x0
#define _PMCONH_PTRDEN_POSITION                             0x0
#define _PMCONH_PTRDEN_SIZE                                 0x1
#define _PMCONH_PTRDEN_LENGTH                               0x1
#define _PMCONH_PTRDEN_MASK                                 0x1
#define _PMCONH_PTWREN_POSN                                 0x1
#define _PMCONH_PTWREN_POSITION                             0x1
#define _PMCONH_PTWREN_SIZE                                 0x1
#define _PMCONH_PTWREN_LENGTH                               0x1
#define _PMCONH_PTWREN_MASK                                 0x2
#define _PMCONH_PTBEEN_POSN                                 0x2
#define _PMCONH_PTBEEN_POSITION                             0x2
#define _PMCONH_PTBEEN_SIZE                                 0x1
#define _PMCONH_PTBEEN_LENGTH                               0x1
#define _PMCONH_PTBEEN_MASK                                 0x4
#define _PMCONH_ADRMUX0_POSN                                0x3
#define _PMCONH_ADRMUX0_POSITION                            0x3
#define _PMCONH_ADRMUX0_SIZE                                0x1
#define _PMCONH_ADRMUX0_LENGTH                              0x1
#define _PMCONH_ADRMUX0_MASK                                0x8
#define _PMCONH_ADRMUX1_POSN                                0x4
#define _PMCONH_ADRMUX1_POSITION                            0x4
#define _PMCONH_ADRMUX1_SIZE                                0x1
#define _PMCONH_ADRMUX1_LENGTH                              0x1
#define _PMCONH_ADRMUX1_MASK                                0x10
#define _PMCONH_PMPEN_POSN                                  0x7
#define _PMCONH_PMPEN_POSITION                              0x7
#define _PMCONH_PMPEN_SIZE                                  0x1
#define _PMCONH_PMPEN_LENGTH                                0x1
#define _PMCONH_PMPEN_MASK                                  0x80

// Register: DMABCH
#define DMABCH DMABCH
extern volatile unsigned char           DMABCH              __at(0xF66);
#ifndef _LIB_BUILD
asm("DMABCH equ 0F66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMACNTHB               :2;
    };
} DMABCHbits_t;
extern volatile DMABCHbits_t DMABCHbits __at(0xF66);
// bitfield macros
#define _DMABCH_DMACNTHB_POSN                               0x0
#define _DMABCH_DMACNTHB_POSITION                           0x0
#define _DMABCH_DMACNTHB_SIZE                               0x2
#define _DMABCH_DMACNTHB_LENGTH                             0x2
#define _DMABCH_DMACNTHB_MASK                               0x3

// Register: DMABCL
#define DMABCL DMABCL
extern volatile unsigned char           DMABCL              __at(0xF67);
#ifndef _LIB_BUILD
asm("DMABCL equ 0F67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMACNTLB               :8;
    };
} DMABCLbits_t;
extern volatile DMABCLbits_t DMABCLbits __at(0xF67);
// bitfield macros
#define _DMABCL_DMACNTLB_POSN                               0x0
#define _DMABCL_DMACNTLB_POSITION                           0x0
#define _DMABCL_DMACNTLB_SIZE                               0x8
#define _DMABCL_DMACNTLB_LENGTH                             0x8
#define _DMABCL_DMACNTLB_MASK                               0xFF

// Register: RXADDRH
#define RXADDRH RXADDRH
extern volatile unsigned char           RXADDRH             __at(0xF68);
#ifndef _LIB_BUILD
asm("RXADDRH equ 0F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMARCVPTRHB            :4;
    };
} RXADDRHbits_t;
extern volatile RXADDRHbits_t RXADDRHbits __at(0xF68);
// bitfield macros
#define _RXADDRH_DMARCVPTRHB_POSN                           0x0
#define _RXADDRH_DMARCVPTRHB_POSITION                       0x0
#define _RXADDRH_DMARCVPTRHB_SIZE                           0x4
#define _RXADDRH_DMARCVPTRHB_LENGTH                         0x4
#define _RXADDRH_DMARCVPTRHB_MASK                           0xF

// Register: RXADDRL
#define RXADDRL RXADDRL
extern volatile unsigned char           RXADDRL             __at(0xF69);
#ifndef _LIB_BUILD
asm("RXADDRL equ 0F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMARCVPTRLB            :8;
    };
} RXADDRLbits_t;
extern volatile RXADDRLbits_t RXADDRLbits __at(0xF69);
// bitfield macros
#define _RXADDRL_DMARCVPTRLB_POSN                           0x0
#define _RXADDRL_DMARCVPTRLB_POSITION                       0x0
#define _RXADDRL_DMARCVPTRLB_SIZE                           0x8
#define _RXADDRL_DMARCVPTRLB_LENGTH                         0x8
#define _RXADDRL_DMARCVPTRLB_MASK                           0xFF

// Register: TXADDRH
#define TXADDRH TXADDRH
extern volatile unsigned char           TXADDRH             __at(0xF6A);
#ifndef _LIB_BUILD
asm("TXADDRH equ 0F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMATXPTRHB             :4;
    };
} TXADDRHbits_t;
extern volatile TXADDRHbits_t TXADDRHbits __at(0xF6A);
// bitfield macros
#define _TXADDRH_DMATXPTRHB_POSN                            0x0
#define _TXADDRH_DMATXPTRHB_POSITION                        0x0
#define _TXADDRH_DMATXPTRHB_SIZE                            0x4
#define _TXADDRH_DMATXPTRHB_LENGTH                          0x4
#define _TXADDRH_DMATXPTRHB_MASK                            0xF

// Register: TXADDRL
#define TXADDRL TXADDRL
extern volatile unsigned char           TXADDRL             __at(0xF6B);
#ifndef _LIB_BUILD
asm("TXADDRL equ 0F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMATXPTRLB             :8;
    };
} TXADDRLbits_t;
extern volatile TXADDRLbits_t TXADDRLbits __at(0xF6B);
// bitfield macros
#define _TXADDRL_DMATXPTRLB_POSN                            0x0
#define _TXADDRL_DMATXPTRLB_POSITION                        0x0
#define _TXADDRL_DMATXPTRLB_SIZE                            0x8
#define _TXADDRL_DMATXPTRLB_LENGTH                          0x8
#define _TXADDRL_DMATXPTRLB_MASK                            0xFF

// Register: PMDIN1L
#define PMDIN1L PMDIN1L
extern volatile unsigned char           PMDIN1L             __at(0xF6C);
#ifndef _LIB_BUILD
asm("PMDIN1L equ 0F6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATAL                  :8;
    };
} PMDIN1Lbits_t;
extern volatile PMDIN1Lbits_t PMDIN1Lbits __at(0xF6C);
// bitfield macros
#define _PMDIN1L_DATAL_POSN                                 0x0
#define _PMDIN1L_DATAL_POSITION                             0x0
#define _PMDIN1L_DATAL_SIZE                                 0x8
#define _PMDIN1L_DATAL_LENGTH                               0x8
#define _PMDIN1L_DATAL_MASK                                 0xFF

// Register: PMDIN1H
#define PMDIN1H PMDIN1H
extern volatile unsigned char           PMDIN1H             __at(0xF6D);
#ifndef _LIB_BUILD
asm("PMDIN1H equ 0F6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATAH                  :8;
    };
} PMDIN1Hbits_t;
extern volatile PMDIN1Hbits_t PMDIN1Hbits __at(0xF6D);
// bitfield macros
#define _PMDIN1H_DATAH_POSN                                 0x0
#define _PMDIN1H_DATAH_POSITION                             0x0
#define _PMDIN1H_DATAH_SIZE                                 0x8
#define _PMDIN1H_DATAH_LENGTH                               0x8
#define _PMDIN1H_DATAH_MASK                                 0xFF

// Register: PMADDRL
#define PMADDRL PMADDRL
extern volatile unsigned char           PMADDRL             __at(0xF6E);
#ifndef _LIB_BUILD
asm("PMADDRL equ 0F6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADDRL                  :8;
    };
} PMADDRLbits_t;
extern volatile PMADDRLbits_t PMADDRLbits __at(0xF6E);
// bitfield macros
#define _PMADDRL_ADDRL_POSN                                 0x0
#define _PMADDRL_ADDRL_POSITION                             0x0
#define _PMADDRL_ADDRL_SIZE                                 0x8
#define _PMADDRL_ADDRL_LENGTH                               0x8
#define _PMADDRL_ADDRL_MASK                                 0xFF

